Repository: utaschulz1/patent-translation-agent
Catalog: Matecat/FRKE_old/FRKE_old.tmx
Source language: en_us
Languages: de_de

source: 4. The metrology system of Claim 1, wherein the one or more x-ray illumination optical elements simultaneously focus the amount of soft x-ray radiation incident at the illumination spot on the specimen at a plurality of angles of incidence, a plurality of wavelengths, a plurality of azimuth angles, or any combination thereof.
de_de: 4. Metrologiesystem nach Anspruch 1, wobei das eine oder die mehreren optischen Röntgenbeleuchtungselemente die an dem Beleuchtungsfleck auf die Probe einfallende Menge von weicher Röntgenstrahlung gleichzeitig unter einer Vielzahl von Einfallswinkeln, einer Vielzahl von Wellenlängen, einer Vielzahl von Azimutwinkeln oder einer beliebigen Kombination davon fokussieren.

source: 5. The metrology system of Claim 1, wherein a source area of the x-ray illumination source (110) is characterized by:
de_de: 5. Metrologiesystem nach Anspruch 1, wobei ein Quellenbereich der Röntgenbeleuchtungsquelle (110) durch Folgendes gekennzeichnet ist:

source: a lateral dimension of 50 micrometers or more; or
de_de: eine laterale Abmessung von 50 Mikrometern oder mehr; oder

source: a lateral dimension of 50 micrometers or less.
de_de: eine laterale Abmessung von 50 Mikrometern oder weniger.

source: 6. The metrology system of Claim 1, wherein the one or more x-ray illumination optical elements focus the amount of soft x-ray radiation onto the specimen with a demagnification factor of 50 or less; or
de_de: 6. Metrologiesystem nach Anspruch 1, wobei das eine oder die mehreren optischen Röntgenbeleuchtungselemente die Menge von weicher Röntgenstrahlung mit einem Verkleinerungsfaktor von 50 oder weniger auf die Probe fokussieren; oder

source: wherein the one or more x-ray illumination optical elements focus the amount of soft x-ray radiation onto the specimen with a demagnification factor of 4 or more.
de_de: wobei das eine oder die mehreren optischen Röntgenbeleuchtungselemente die Menge von weicher Röntgenstrahlung mit einem Verkleinerungsfaktor von 4 oder mehr auf die Probe fokussieren.

source: 7. The metrology system of Claim 1, the one or more x-ray illumination optical elements including:
de_de: 7. Metrologiesystem nach Anspruch 1, wobei das eine oder die mehreren optischen Röntgenbeleuchtungselemente Folgendes beinhalten:

source: two or more spherically shaped mirrors (211, 212) configured in a Schwarzschild configuration; or
de_de: zwei oder mehr kugelförmige Spiegel (211, 212), die in einer Schwarzschild-Konfiguration konfiguriert sind; oder

source: an ellipsoidally shaped mirror (221); or
de_de: einen ellipsoidförmigen Spiegel (221); oder

source: two or more mirrors configured in a Wolter configuration(231, 232); or
de_de: zwei oder mehr in einer Wolter-Konfiguration konfigurierte Spiegel (231, 232); oder

source: at least one mirror having a freeform shape (241); or
de_de: mindestens einen Spiegel mit einer Freiformform (241); oder

source: one or more illumination optical elements configured in a Scheimpflug configuration.
de_de: ein oder mehrere optische Beleuchtungselemente, die in einer Scheimpflug-Konfiguration konfiguriert sind.

source: 8. The metrology system of Claim 1, wherein the x-ray illumination source (110) is tilt shifted with respect to the specimen under measurement.
de_de: 8. Metrologiesystem nach Anspruch 1, wobei die Röntgenbeleuchtungsquelle (110) in Bezug auf die zu messende Probe neigungsverstellt und versetzt ist.

source: 9. The metrology system of Claim 1, wherein a size, shape, or both, of the at least one field stop is adjustable to optimize throughput, minimize diffraction order cross talk, match to another metrology system, or any combination thereof.
de_de: 9. Metrologiesystem nach Anspruch 1, wobei eine Größe, eine Form oder beides der mindestens einen Feldblende einstellbar ist, um einen Durchsatz zu optimieren, Beugungsordnungsübersprechen zu minimieren, auf ein anderes Metrologiesystem abzustimmen oder eine beliebige Kombination davon.

source: The metrology system of Claim 1, wherein the illumination optics subsystem includes an illumination pupil aperture; or
de_de: Metrologiesystem nach Anspruch 1, wobei das Beleuchtungsoptikteilsystem eine Beleuchtungspupillenapertur beinhaltet; oder

source: wherein the illumination optics subsystem includes an illumination pupil aperture; and
de_de: wobei das Beleuchtungsoptikteilsystem eine Beleuchtungspupillenapertur beinhaltet; und

source: wherein a size, shape, or both, of the illumination pupil aperture is adjustable to optimize throughput, minimize diffraction order cross talk, match to another metrology system, or any combination thereof.
de_de: wobei eine Größe, eine Form oder beides der Beleuchtungspupillenapertur einstellbar ist, um einen Durchsatz zu optimieren, Beugungsordnungsübersprechen zu minimieren, auf ein anderes Metrologiesystem abzustimmen oder eine beliebige Kombination davon.

source: The metrology system of Claim 1, wherein the one or more x-ray illumination optical elements select a subset of the multiple illumination wavelengths and focus the selected subset of the multiple wavelengths onto the specimen; or
de_de: Metrologiesystem nach Anspruch 1, wobei das eine oder die mehreren optischen Röntgenbeleuchtungselemente eine Teilmenge der vielen Beleuchtungswellenlängen auswählen und die ausgewählte Teilmenge der vielen Wellenlängen auf die Probe fokussieren; oder

source: wherein the determining of the one or more parameters of interest is based on a combined fitting analysis of the detected amount of x-ray radiation and optical measurement signals.
de_de: wobei das Bestimmen des einen oder der mehreren interessierenden Parameter basierend auf einer kombinierten Fitting-Analyse der detektierten Menge von Röntgenstrahlung und der optischen Messsignale erfolgt.

source: A method (200) comprising:
de_de: Verfahren (200), umfassend:

source: generating an amount of soft x-ray radiation;
de_de: Erzeugen einer Menge von weicher Röntgenstrahlung;

source: focusing the amount of soft x-ray radiation from an x-ray illumination source to an illumination spot on a specimen under measurement, wherein a length of the illumination optical path from the x-ray illumination source to the specimen under measurement is less than 2 meters, and wherein the amount of soft x-ray radiation is focused onto the illumination spot with a demagnification factor of at least 1.25 (202), and wherein an internal field stop is disposed in the illumination optical path, the internal field stop conjugate to the illumination source and the specimen under measurement;
de_de: Fokussieren der Menge von weicher Röntgenstrahlung von einer Röntgenbeleuchtungsquelle auf einen Beleuchtungsfleck auf einer zu messenden Probe, wobei die Länge des optischen Beleuchtungspfads von der Röntgenbeleuchtungsquelle zu der zu messenden Probe weniger als 2 Meter ist, wobei die Menge von weicher Röntgenstrahlung mit einem Verkleinerungsfaktor von mindestens 1,25 auf den Beleuchtungsfleck fokussiert wird (202), und wobei in dem optischen Beleuchtungspfad eine interne Feldblende angeordnet ist, wobei die interne Feldblende zu der Beleuchtungsquelle und zu der zu messenden Probe konjugiert ist;

source: detecting an amount of x-ray radiation scattered from the specimen under measurement in response to the incident x-ray radiation (203); and
de_de: Detektieren einer Menge von Röntgenstrahlung, die von der zu messenden Probe als Reaktion auf die einfallende Röntgenstrahlung gestreut ist (203); und

source: determining a value of a parameter of interest characterizing a structure disposed on the specimen based on the detected amount of x-ray radiation (204).
de_de: Bestimmen eines Werts eines interessierenden Parameters, der eine auf der zu messenden Probe angeordnete Struktur kennzeichnet, basierend auf der detektierten Menge von Röntgenstrahlung (204).

source: The method of Claim 12, further comprising:
de_de: Verfahren nach Anspruch 12, ferner umfassend:

source: simultaneously focusing the amount of soft x-ray radiation incident at the illumination spot on the specimen at a plurality of angles of incidence, a plurality of wavelengths, a plurality of azimuth angles, or any combination thereof.
de_de: gleichzeitiges Fokussieren der an dem Beleuchtungsfleck auf die zu messende Probe einfallenden Menge von weicher Röntgenstrahlung unter einer Vielzahl von Einfallswinkeln, einer Vielzahl von Wellenlängen, einer Vielzahl von Azimutwinkeln oder einer beliebigen Kombination davon.

source: The method of Claim 12, wherein the focusing involves:
de_de: Verfahren nach Anspruch 12, wobei das Fokussieren Folgendes involviert:

source: two spherically shaped mirrors configured in a Schwarzschild configuration; or
de_de: zwei in einer Schwarzschild-Konfiguration konfigurierte kugelförmige Spiegel; oder

source: an ellipsoidally shaped mirror; or
de_de: einen ellipsoidförmigen Spiegel; oder

source: two or more mirrors configured in a Wolter configuration; or
de_de: zwei oder mehr in Wolter-Konfiguration konfigurierte Spiegel; oder

source: at least one mirror having a freeform shape; or one or more illumination optical elements configured in a Scheimpflug configuration; or
de_de: mindestens einen Spiegel mit einer Freiformform; oder ein oder mehrere optische Beleuchtungselemente, die in einer Scheimpflug-Konfiguration konfiguriert sind; oder

source: tilt shifting the x-ray illumination source with respect to the specimen under measurement.
de_de: Neigungsverstellen und Versetzen der Röntgenbeleuchtungsquelle in Bezug auf die zu messende Probe.

source: selecting a subset of the multiple illumination wavelengths; and
de_de: Auswählen einer Teilmenge der vielen Beleuchtungswellenlängen; und

source: focusing the selected subset of the multiple wavelengths onto the specimen.
de_de: Fokussieren der ausgewählten Teilmenge der vielen Wellenlängen auf die Probe.

source: 1. A display system comprising:
de_de: 1. Anzeigesystem, umfassend:

source: a plurality of waveguides (3002, 3004, 3006, 3008) forming a stack of waveguides (3000); and
de_de: eine Vielzahl von Wellenleitern (3002, 3004, 3006, 3008), die einen Stapel von Wellenleitern (3000) ausbilden; und

source: an image injection device (3021) configured to direct a multiplexed light stream (3040) to be coupled into the waveguides (3002, 3004, 3006, 3008), the multiplexed light stream (3040) comprising a first light stream (A) having at least one first light property and a second light stream (B) having at least one second light property that is different than the at least one first light property,
de_de: eine Bildeinbringungsvorrichtung (3021), die konfiguriert ist, einen in die Wellenleiter (3002, 3004, 3006, 3008) einzukoppelnden Multiplexing-Lichtstrom (3040) zu lenken, wobei der Multiplexing-Lichtstrom (3040) einen ersten Lichtstrom (A), der mindestens eine erste Lichteigenschaft aufweist, und einen zweiten Lichtstrom (B), der mindestens eine zweite Lichteigenschaft aufweist, die von der mindestens einen ersten Lichteigenschaft verschieden ist, umfasst,

source: wherein the at least one first light property includes a first wavelength and the at least one second light property includes a second wavelength that is different from the first wavelength,
de_de: wobei die mindestens eine erste Lichteigenschaft eine erste Wellenlänge beinhaltet und die mindestens eine zweite Lichteigenschaft eine zweite Wellenlänge beinhaltet, die von der ersten Wellenlänge verschieden ist,

source: wherein the first light stream (A) and the second light stream (B) have a same polarization,
de_de: wobei der erste Lichtstrom (A) und der zweite Lichtstrom (B) dieselbe Polarisation aufweisen,

source: wherein the plurality of waveguides (3002, 3004, 3006, 3008) comprises a first waveguide (3002) comprising one or more in-coupling optical elements (3012) configured to selectively in-couple light based on wavelength such that the one or more in-coupling optical elements (3012) are configured to selectively in-couple the first light stream (A) having the first wavelength and the polarization while being transmissive to the second light stream (B) having the second wavelength and the polarization, and
de_de: wobei die Vielzahl von Wellenleitern (3002, 3004, 3006, 3008) einen ersten Wellenleiter (3002) umfasst, der ein oder mehrere einkoppelnde optische Elemente (3012) umfasst, die konfiguriert sind, Licht basierend auf der Wellenlänge selektiv derart einzukoppeln, dass das eine oder die mehreren einkoppelnden optischen Elemente (3012) konfiguriert sind, den ersten Lichtstrom (A) mit der ersten Wellenlänge und der ersten Polarisation selektiv einzukoppeln, während sie für den zweiten Lichtstrom (B) mit der zweiten Wellenlänge und der zweiten Polarisation durchlässig sind, und

source: characterised in that the one or more in-coupling optical elements (3012) include a metasurface.
de_de: dadurch gekennzeichnet, dass das eine oder die mehreren einkoppelnden optischen Elemente (3012) eine Metafläche beinhalten.

source: 2. The display system of claim 1, wherein the plurality of waveguides (3002, 3004, 3006, 3008) comprises a second waveguide (3004) comprising one or more second in-coupling optical elements (3014) configured to selectively in-couple the second light stream (B), the second in-coupling optical elements (3014) including a metasurface.
de_de: 2. Anzeigesystem nach Anspruch 1, wobei die Vielzahl von Wellenleitern (3002, 3004, 3006, 3008) einen zweiten Wellenleiter (3004) umfasst, der ein oder mehrere zweite einkoppelnde optische Elemente (3014) umfasst, die konfiguriert sind, den zweiten Lichtstrom (B) selektiv einzukoppeln, wobei die zweiten einkoppelnden optischen Elemente (3014) eine Metafläche beinhalten.

source: 3. The display system of claim 2, wherein the one or more second in-coupling optical elements (3014) are disposed at least partly over the one or more first in-coupling optical elements (3012).
de_de: 3. Anzeigesystem nach Anspruch 2, wobei das eine oder die mehreren zweiten einkoppelnden optischen Elemente (3014) mindestens teilweise oberhalb der einen oder der mehreren ersten einkoppelnden optischen Elementen (3012) angeordnet sind.

source: 4. The display system of claim 2, wherein the multiplexed light stream (3040) further comprises a third light stream (C) having at least one different light property than the first light stream (A) and the second light stream (B), and wherein the plurality of waveguides (3002, 3004, 3006, 3008) comprises a third waveguide (3006) comprising one or more third in-coupling optical elements (3016) configured to selectively in-couple the third light stream (C), the one or more third in-coupling optical elements (3016) including a metasurface.
de_de: 4. Anzeigesystem nach Anspruch 2, wobei der Multiplexing-Lichtstrom (3040) ferner einen dritten Lichtstrom (C) umfasst, der mindestens eine von der des ersten Lichtstroms (A) und der des zweiten Lichtstroms (B) verschiedene Lichteigenschaft aufweist, und wobei die Vielzahl von Wellenleitern (3002, 3004, 3006, 3008) einen dritten Wellenleiter (3006) umfasst, der ein oder mehrere dritte einkoppelnde optische Elemente (3016) umfasst, die konfiguriert sind, den dritten Lichtstrom (C) selektiv einzukoppeln, wobei das eine oder die mehreren dritten einkoppelnden optischen Elemente (3016) eine Metafläche beinhalten.

source: 5. The display system of claim 4, wherein the one or more third in-coupling optical elements (3016) are disposed at least partly over the one or more second in-coupling optical elements (3014).
de_de: 5. Anzeigesystem nach Anspruch 4, wobei das eine oder die mehreren dritten einkoppelnden optischen Elemente (3016) mindestens teilweise oberhalb des einen oder der mehreren zweiten einkoppelnden optischen Elemente (3014) angeordnet sind.

source: 6. The display system of claim 4, wherein the one or more second in-coupling optical elements (3014) are disposed at least partly over the one or more first in-coupling optical elements (3012), and wherein the one or more third in-coupling optical elements (3016) are disposed at least partly over the one or more second in-coupling optical elements (3014).
de_de: 6. Anzeigesystem nach Anspruch 4, wobei das eine oder die mehreren zweiten einkoppelnden optischen Elemente (3014) mindestens teilweise oberhalb des einen oder der mehreren ersten einkoppelnden optischen Elemente (3012) angeordnet sind und wobei das eine oder die mehreren dritten einkoppelnden optischen Elemente (3016) mindestens teilweise oberhalb des einen oder der mehreren zweiten einkoppelnden optischen Elemente (3014) angeordnet sind.

source: 7. The display system of any of claims 4-6, wherein the one or more first in-coupling optical elements (3012), the one or more second in-coupling optical elements (3014), and the one or more third in-coupling optical elements (3016) are configured to redirect light corresponding to different colors such that the redirected light propagates through a respective waveguide (3002, 3004, 3006, 3008) by total internal reflection.
de_de: 7. Anzeigesystem nach einem der Ansprüche 4 bis 6, wobei das eine oder die mehreren ersten einkoppelnden optischen Elemente (3012), das eine oder die mehreren zweiten einkoppelnden optischen Elemente (3014) und das eine oder die mehreren dritten einkoppelnden optischen Elemente (3016) konfiguriert sind, das verschiedenen Farben entsprechende Licht derart umzulenken, dass sich das umgelenkte Licht durch einen jeweiligen Wellenleiter (3002, 3004, 3006, 3008) durch Totalreflexion ausbreitet.

source: 8. The display system of any of claims 1-7, wherein the first waveguide (3002) comprises one or more orthogonal pupil expanders (3062a), wherein the one or more first in-coupling optical elements (3012) are configured to redirect the first light stream (A) to the one or more orthogonal pupil expanders (3062a).
de_de: 8. Anzeigesystem nach einem der Ansprüche 1 bis 7, wobei der erste Wellenleiter (3002) einen oder mehrere orthogonale Pupillenerweiterer (3062a) umfasst, wobei das eine oder die mehreren ersten einkoppelnden optischen Elemente (3012) konfiguriert sind, den ersten Lichtstrom (A) zu dem einen oder den mehreren orthogonalen Pupillenerweiterern (3062a) umzulenken.

source: 9. The display system of any of claims 1-8, wherein the image injection device (3021) comprises at least one of a scanning fiber device or a light modulating device comprising pixel elements providing controllable variable transmission of light to the waveguide.
de_de: 9. Anzeigesystem nach einem der Ansprüche 1 bis 8, wobei die Bildeinbringungsvorrichtung (3021) mindestens eine Pixelelemente umfassende Abtastfaservorrichtung oder eine Lichtmodulationsvorrichtung umfasst, die eine steuerbare, variable Durchlässigkeit von Licht zu dem Wellenleiter bereitstellen.

source: The display system of any of claims 1-9, wherein the image injection device (3021) is configured to simultaneously provide the first light stream (A) and the second light stream (B) to the stack of waveguides (3000).
de_de: Anzeigesystem nach einem der Ansprüche 1 bis 9, wobei die Bildeinbringungsvorrichtung (3021) konfiguriert ist, dem Stapel von Wellenleitern (3000) gleichzeitig den ersten Lichtstrom (A) und den zweiten Lichtstrom (B) bereitzustellen.

source: The display system of any of claims 1-10, wherein the wherein the image injection device (3021) is configured to provide the first light stream (A) and the second light stream (B) to the stack of waveguides (3000) at different times.
de_de: Anzeigesystem nach einem der Ansprüche 1 bis 10, wobei die Bildeinbringungsvorrichtung (3021) konfiguriert ist, den ersten Lichtstrom (A) und den zweiten Lichtstrom (B) dem Stapel von Wellenleitern (3000) zu verschiedenen Zeitpunkten bereitzustellen.

source: The display system of any of claims 1-11, wherein the metasurface is a Pancharatnam-Berry Phase Effect, PBPE, structure.
de_de: Anzeigesystem nach einem der Ansprüche 1 bis 11, wobei die Metafläche eine Pancharatnam-Berry-Phaseneffekt(PBPE)-Struktur ist.

source: The display system of any of claims 1-12, wherein the first metasurface is formed of a liquid crystal material.
de_de: Anzeigesystem nach einem der Ansprüche 1 bis 12, wobei die erste Metafläche aus einem Flüssigkristallmaterial ausgebildet ist.

source: 1. An apparatus (101) for obtaining ion energy distribution, IED, measurements in a plasma processing system comprising:
de_de: 1. Gerät (101) zum Erlangen von Messungen der Ionenenergieverteilung (Ion Energy Distribution – IED) in einem Plasmaverarbeitungssystem, umfassend:

source: a substrate for placement in the plasma processing system and exposure to the plasma, the substrate having an ion energy analyser (201) disposed therein for measuring the ion energy distribution at the substrate surface during plasma processing, the analyser comprising a plurality of conductive grids, and a collection electrode, each conductive grid separated by an insulating layer (205);
de_de: ein Substrat zum Einsetzen in das Plasmaverarbeitungssystem und zum Aussetzen gegenüber dem Plasma, wobei das Substrat einen darin angeordneten Ionenenergieanalysator (201) zum Messen der Ionenenergieverteilung an der Substratoberfläche während der Plasmaverarbeitung aufweist, wobei der Analysator eine Vielzahl von leitenden Gittern und eine Sammelelektrode umfasst, wobei jedes leitende Gitter durch eine Isolierschicht (205) getrennt ist;

source: wherein the apparatus further comprises:
de_de: wobei das Gerät ferner Folgendes umfasst:

source: a battery power supply and a battery manager integrated in the substrate, for supplying and controlling voltage to each of the conductive grids and the collector of the ion energy analyser;
de_de: eine in das Substrat integrierte Batteriestromversorgung und eine Batterieverwaltung, zum Zuführen und Steuern von Spannung jedes der leitenden Gitter und des Kollektors des Ionenenergieanalysators;

source: a high voltage generating circuit (800, 900) within the substrate and configured to take the output voltage of the battery manager to power the high voltage generating circuit and apply a voltage sweep to a first conductive grid of the plurality of conductive grids; and
de_de: eine Hochspannungserzeugungsschaltung (800, 900) innerhalb des Substrats, die konfiguriert ist, um die Ausgangsspannung der Batterieverwaltung zu verwenden, um die Hochspannungserzeugungsschaltung mit Energie zu versorgen und eine Spannungsrampe an ein erstes leitendes Gitter der Vielzahl von leitenden Gittern anzulegen; und

source: a first resistor (1002) in series between the first conductive grid and the high voltage generating circuit.
de_de: einen ersten Widerstand (1002) in Reihe zwischen dem ersten leitenden Gitter und der Hochspannungserzeugungsschaltung.

source: 2. The apparatus (101) for obtaining IED measurements of claim 1 further comprising a plurality of second resistors (1002), each second resistor (1002) in series between a respective conductive grid, other than the first conductive grid, and a corresponding voltage source connected to the battery manager.
de_de: 2. Das Gerät (101) zum Erlangen von IED-Messungen nach Anspruch 1, ferner umfassend eine Vielzahl von zweiten Widerständen (1002), wobei jeder zweite Widerstand (1002) in Reihe zwischen einem jeweiligen leitenden Gitter, das sich von dem ersten leitenden Gitter unterscheidet, und einer entsprechenden Spannungsquelle ist, die mit der Batterieverwaltung verbunden ist.
